ttyaaron/ME218B_TeamProject/LeaderPIC.X/ProjectSource/PIC32_SPI_HAL.c
}

static uint8_t isSDIPinLegal( SPI_Module_t module, SPI_PinMap_t WhichPin)
{
  // Your Code goes here :-)
  uint8_t index;
  uint8_t pin = 0xff;
  
  for( index = 0; 
       index <= ((sizeof(LegalSDIPins[0])/sizeof(LegalSDIPins[0][0]))-1);
       index++)
  {
    if (LegalSDIPins[module][index] == WhichPin)
    {
        pin = index;
        return pin;
    }
  }
  return pin;

}
/*
int main(void) {
    SPI_Module_t Module = SPI_SPI1;
    SPI_SamplePhase_t SamplePhase = SPI_SMP_MID;
    uint32_t DesiredClock_ns = 100000;
    SPI_PinMap_t SSPin = SPI_RPA0;
    SPI_PinMap_t SDOPin = SPI_RPA1;
    SPI_Clock_t ClockIdle = SPI_CLK_HI;
    SPI_ActiveEdge_t ChosenEdge = SPI_FIRST_EDGE;
    SPI_XferWidth_t DataWidth = SPI_16BIT;
    
    
    
    SPISetup_BasicConfig(Module);
    SPISetup_SetLeader(Module, SamplePhase);
    SPISetup_SetBitTime(Module, DesiredClock_ns);
    SPISetup_MapSSOutput(Module, SSPin);
    SPISetup_MapSDOutput(Module, SDOPin);
    
    SPISetup_SetClockIdleState(Module, ClockIdle);
    SPISetup_SetActiveEdge(Module, ChosenEdge);
    SPISetup_SetXferWidth(Module, DataWidth);
    SPISetEnhancedBuffer(Module, true);
    
    SPISetup_EnableSPI(Module);
    
    
    uint16_t message[] = {0x004D, 0x0045, 0x0032, 0x0031, 0x0038, 0x804D, 0x8045, 0x8032, 0x8031, 0x8038};

    uint8_t message_size = sizeof(message) / sizeof(uint16_t);
    uint8_t letter = 0;
    while(letter < message_size) {
        if(Module == SPI_SPI1) {
            if(!SPI1STATbits.SPITBF) {
                SPIOperate_SPI1_Send16Wait(message[letter]);
                letter++;
            }
        }
    }
    
    
}*/